Tekla Open API Reference for Tekla Structures 2025
SpiralBeam.RotationAxisBasePoint Property
 Gets or sets the first definition point of the spiral beam rotation axis.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point RotationAxisBasePoint { get; set; }
Public Property RotationAxisBasePoint As Point
	Get
	Set
Property Value
Type: Point
See Also
Reference
SpiralBeam Class
Tekla.Structures.Model Namespace